tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'heroku/brew'
tap 'd12frosted/emacs-plus'

# essential
brew 'git'
brew 'vim'
brew 'rbenv'
brew 'ruby-build'
brew 'rbspy'
brew 'tmux'
brew 'postgresql'
brew 'zsh'
brew 'ag'
brew 'mas'
brew 'emacs-plus'

brew 'node'
brew 'awscli'
brew 'packer'
brew 'terraform'

#brew 'hyper'

# tools
#brew 'graphviz'
#brew 'httpie'

brew 'ctags'
brew 'jmeter'
brew 'heroku'

brew 'golang'
#brew 'python'
#brew 'bash-completion'
#brew 'maven'
#brew 'ack'
#brew 'wget'
#brew 'tig'
#brew 'gpg'
#brew 'gnupg'
#brew 'gpg-agent'
#brew 'pinentry-mac'

cask 'arduino'
#cask 'atom'
#cask 'calibre'
#cask 'firefox'
#cask 'grammarly'
#cask 'insomnia'
#cask 'limechat'
#cask 'lingo'
#cask 'mockplus'
#cask 'notational-velocity'
#cask 'rowanj-gitx'
#cask 'sketch'
#cask 'skype'
#cask 'vlc'
#cask 'zeplin'
cask 'alacritty'
cask 'android-studio'
cask 'authy'
cask 'boostnote'
cask 'docker'
cask 'dropbox'
# cask 'emacs'
cask 'evernote'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'macvim'
cask 'notion'
cask 'oracle-jdk'
cask 'postman'
cask 'pritunl'
cask 'psequel'
cask 'slack'
cask 'spectacle'
cask 'spotify'

# cask 'font-source-code-pro'
# cask 'font-inconsolata'
# cask 'font-inconsolata-for-powerline'
# cask 'font-devicons'
cask 'font-lato'
cask 'font-hack-nerd-font'
cask 'font-roboto'
cask 'font-roboto-slab'

mas 'Keynote', id: 409183694
mas 'Microsoft OneNote', id: 784801555

# vi: ft=ruby
