tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'python'
brew 'git'
brew 'bash-completion'
brew 'rbenv'
brew 'ruby-build'
brew 'maven'
brew 'ack'
brew 'node'
brew 'mysql'
brew 'redis'
brew 'wget'
brew 'packer'
brew 'vim'
brew 'tmux'
brew 'zsh'

cask 'arduino'
cask 'google-chrome'
cask 'dropbox'
cask 'firefox'
cask 'limechat'
cask 'notational-velocity'
cask 'copy'
cask 'iterm2'
cask 'calibre'
cask 'atom'
cask 'spectacle'
cask 'heroku-toolbelt'
cask 'rowanj-gitx'
cask 'skype'
cask 'vlc'
cask 'slack'
cask 'virtualbox'
